{"inkVersion":21,"root":[[{"->":"main"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"main":[["^A dejected-looking man in a grey suit sits on a bench, just outside Barnaby's, a major jewelry store. He's all but crying into his hands. You see an opportunity here.","\n","ev","str","^Drive up and ask what's wrong.","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"continue"},"\n",{"#f":5}]}],{"#f":1}],"continue":[["^The man looks up at you, weighing his options, then speaks. \"I... my girl, she had her heart set on this one ring. Real thing a' beauty, but way outta my price range. The clerk I was talkin' to says he can cut me a deal, hold it for me while I pay off it in installments....\" The man trails off, then shakes himself slightly. \"That was eight months ago. I finally saved up enough to get it, but the damn crook raised the price on me, and now he's threatenin' to sell it if I don't come back with more!\" His voice begins to tremble. \"I... i was gonna propose to her with that ring... but now...\"","\n","ev","str","^Offer to \"have a talk\" with the crooked clerk.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Convince him he doesn't need a ring to show his affection.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","ev",10,{"x()":"AddCash","exArgs":1},"pop","/ev","\n","ev",-5,{"x()":"AlterCopRelations","exArgs":1},"pop","/ev","\n","ev",5,{"x()":"AlterCivilianRelations","exArgs":1},"pop","/ev","\n","^You discreetly show off your weapon and offer to make the clerk reconsider. Ten minutes later, you and the man are standing outside the store, the man beaming with the ring in his hands. The nice clerk even deigned to give the man a discount, which he graciously gave back to you! ","end","\n",{"#f":5}],"c-1":["\n","^If she truly loves him, she doesn't need any stinking ring! But if he's deadset on one, he could try a jeweler in Little Italy that could cut him a deal- a jeweler who may or may not be your cousin...","\n","ev",10,16,18,{"x()":"StartNegotiation","exArgs":3},"pop","/ev","\n","^Negotiation time!","\n","ev",{"VAR?":"negotiationSuccess"},"/ev",["du","ev",true,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->":"success"},{"->":".^.^.^.19"},null]}],["du","ev",false,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->":"failure"},{"->":".^.^.^.19"},null]}],"pop","nop","\n",{"#f":5}]}],{"#f":1}],"success":["ev",15,{"x()":"AddCash","exArgs":1},"pop","/ev","\n","ev",3,{"x()":"AlterCivilianRelations","exArgs":1},"pop","/ev","\n","^The man thanks you for your advice and provides you with a parting gift before darting off. ","end","\n",{"#f":1}],"failure":["ev",1,{"x()":"AlterCivilianRelations","exArgs":1},"pop","/ev","\n","^The man thanks you for your kindness, but politely declines your offer. ","end","\n",{"#f":1}],"global decl":["ev",false,{"VAR=":"negotiationSuccess"},"/ev","end",null],"#f":1}],"listDefs":{}}