{"inkVersion":21,"root":[[{"->":"main"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"main":[["^Okay, you know how I said there's some mean Mother Hubbards out for blood? Well, looks like some of 'em are heading straight towards you!","\n","ev","str","^Bring it... on?","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"Choice"},"\n",{"#f":5}]}],{"#f":1}],"Choice":[["^Yes, yes, you can take a swing at 'em this time. But listen up first, 'cause you need t'know how to scrap in these parts.","\n","ev","str","^Please regale me, mysterious voice!","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^I already know how.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ",{"->":"Tutorial"},"\n",{"#f":5}],"c-1":["\n","^A'ight, fine. You think know what you're doing? Go ahead. Skip my spiel. I'm not upset or anything. If you find you need a refresher, you can hover your mouse over certain icons to get some hints. Good luck.","\n","ev",{"x()":"StartCombat"},"pop","/ev","\n","end",{"#f":5}]}],{"#f":1}],"Tutorial":[["^Click n' drag a card towards an enemy -that'd be the the goons to the right- to execute the card's effects on that enemy. However, usin' a card comes at a cost.","\n","^In the top right, ye'll see a belt 'o bullets. Those are yer caps, which ye only have a set amount of per turn! Each of yer cards has a number on it; that's its cap cost.","\n","^Once you're out, you gotta end your turn using the button in the bottom right and take your lumps from whoever's standing opposite.","\n","^Got all that?","\n","ev","str","^Yep.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Can you repeat all that?","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","^Good, because here they come! If you need a refresher, you can hover your mouse over certain icons to get some hints! Now get to defending yourself!","\n","ev",{"x()":"StartCombat"},"pop","/ev","\n","end",{"#f":5}],"c-1":["\n","^Weren't listening, eh? You're lucky I'm patient. Let's go over this again.","\n",{"->":".^.^.^"},{"#f":5}]}],{"#f":1}],"#f":1}],"listDefs":{}}