{
	"Talkers": [
		{
			"TalkerId": 1,
			"TalkerName": "Cop1",
			"TalkerText": "A group of disheveled looking men and women approach your car. Their clothes are worn and sweaty, and a few of them carry knives and improvised clubs. They do not appear to be having a good time. One of them speaks up. 'Oi! We know youse gots the good stuff! We ain't had nothin since our pub closed down- give us some, or else!' How could they know? Are they bluffing?",
			"TalkerType": "Combat",
			"Optioncount": 2,
			"Option1": "Sock it to 'em!",
			"Option2": "Give them a bottle.",
			"Option3": "text",
			"Option4": "text",
			"Option1outcome": "They don't look so tough. You can take them.",
			"Option2outcome": "Might as well not attract too much attention.",
			"Option3outcome": "text",
			"Option4outcome": "text"
		},
		{
			"TalkerId": 2,
			"TalkerName": "Cop2",
			"TalkerText": "nuh-uh",
			"TalkerType": "Combat",
			"Optioncount": 2,
			"Option1": "text",
			"Option2": "text",
			"Option3": "text",
			"Option4": "text",
			"Option1outcome": "text",
			"Option2outcome": "text",
			"Option3outcome": "text",
			"Option4outcome": "text"
		},
		{
			"TalkerId": 3,
			"TalkerName": "Cop3",
			"TalkerText": "*Bang*",
			"TalkerType": "Combat",
			"Optioncount": 2,
			"Option1": "text",
			"Option2": "text",
			"Option3": "text",
			"Option4": "text",
			"Option1outcome": "text",
			"Option2outcome": "text",
			"Option3outcome": "text",
			"Option4outcome": "text"
		},
		{
			"TalkerId": 1,
			"TalkerName": "Gamer",
			"TalkerText": "As you stop at an intersection, you feel a slight bump and hear a clang of metal. Looking out the window, some ignoramus didn't stop in time and rear ended you! Irate, the man and his passenger jumps out of his automobile, demanding your name and compensation... was this on purpose? ",
			"TalkerType": "Negotiation",
			"Optioncount": 2,
			"Option1": "Defuse the situation.",
			"Option2": "Give him something to complain about (Combat).",
			"Option3": "text",
			"Option4": "text",
			"Option1outcome": "You step out of your car and attempt to calm him down.",
			"Option2outcome": "As you get out of your car and draw your weapons, the man pauses then launches himself at you.",
			"Option3outcome": "text",
			"Option4outcome": "text"
		},
		{
			"TalkerId": 2,
			"TalkerName": "non-gamer",
			"TalkerText": "I am not gaming",
			"TalkerType": "Negotiation",
			"Optioncount": 4,
			"Option1": "text",
			"Option2": "text",
			"Option3": "text",
			"Option4": "text",
			"Option1outcome": "text",
			"Option2outcome": "text",
			"Option3outcome": "text",
			"Option4outcome": "text"
		},
		{
			"TalkerId": 1,
			"TalkerName": "Event1",
			"TalkerText": "A baker, transporting his goods by hand cart, has an unlucky break- that being one of his cart's wheels. As his bread spills over the road, a nearby policeman stops traffic to assist him.",
			"TalkerType": "Event",
			"Optioncount": 3,
			"Option1": "Get out and help the baker.",
			"Option2": "Don't risk it.",
			"Option3": "Get outta there!",
			"Option4": "text",
			"Option1outcome": "You hop out of the truck and quickly help the baker rein in his wayward grains. The policeman notices you.",
			"Option2outcome": "You shrink down in the car, attempting to make yourself unrecognizable.",
			"Option3outcome": "You gun it, running over the baker's dozen or so loaves.",
			"Option4outcome": "text"
		},
		{
			"TalkerId": 2,
			"TalkerName": "Event2",
			"TalkerText": "A small orange and white cat runs into the road, followed closely by a young girl. The car has to swerve to a stop to avoid hitting her.",
			"TalkerType": "Event",
			"Optioncount": 3,
			"Option1": "Tell her off.",
			"Option2": "Continue on your way.",
			"Option3": "Give her something to keep her off the road.",
			"Option4": "text",
			"Option1outcome": "The girl scoops up the cat and runs off crying, noticed by a few passersby.",
			"Option2outcome": "The cat and girl wander off the road and you continue onwards.",
			"Option3outcome": "You toss her a dollar and tell her to get a candy from the market. She takes it, beaming, and hurries off, the cat following close behind her.",
			"Option4outcome": "text"
		},
		{
			"TalkerId": 3,
			"TalkerName": "Event3",
			"TalkerText": "A crowd of civilians cross the street. And cross. And cross... and they don't seem to be stopping anytime soon.",
			"TalkerType": "Event",
			"Optioncount": 3,
			"Option1": "Beep at them.",
			"Option2": "Inch forward.",
			"Option3": "Gun  it.",
			"Option4": "text",
			"Option1outcome": "Startled, some of the passersby drop their bags. Some people...",
			"Option2outcome": "You slowly inch forward into the stream of people and they flow around you like water. Within a couple seconds, you're on the other side of the strange deluge. How bizarre...",
			"Option3outcome": "You floor the accelerator, tires squealing. You don't hit anyone, luckily, but people have to throw themselves out of the way. Somehow, a purse ends up snagged to the hood ornament.",
			"Option4outcome": "text"
		},
		{
			"TalkerId": 4,
			"TalkerName": "Event4",
			"TalkerText": "Stopped at a red light, an enterprising young man in a red-and-white paper hat strolls up to your car. Knocking on a window, he proffers what seems to be a sausage on a long, thin bun. He clears his throat and speaks. 'Getcha fresh, delicious hot dogs! Good for what ails ya! Two bucks for three! Best dogs this side of the Park, no buts about it!' It does smell pretty good...",
			"TalkerType": "Event",
			"Optioncount": 3,
			"Option1": "Pay for the decadent dogs.",
			"Option2": "Roll up the window.",
			"Option3": "'Persuade' him to donate his wares.",
			"Option4": "text",
			"Option1outcome": "You hand the man two bucks and in returns he hands you a paper tray with three frankfurters, still steaming from his cart. They're delicious.",
			"Option2outcome": "You're not hungry right now. You politely decline and roll up the window. The man moves on to the car behind you.",
			"Option3outcome": "You pull a gun on him and take his dog. He hightails it back to his cart and starts packing it up. As the light turns green, you take a bite. It tastes pretty good... the secret ingredient is crime.",
			"Option4outcome": "text"
		},
		{
			"TalkerId": 5,
			"TalkerName": "Event5",
			"TalkerText": "A dejected-looking man in a grey suit sits on a bench, just outside Barnaby's, a major jewelry store. He's all but crying into his hands. Sensing an opportunity, you drive up to him, roll down your window, and ask what's wrong. The man looks up at you, weighing his options, then speaks. 'I... my girl, rather... you see... she had her heart set on this one ring. Real thing a' beauty, but way outta my price range. The clerk I was talkin' to says he can cut me a deal, hold it for me while I pay off it in installments....' The man trails off, then shakes himself slightly. He continues,'That was eight months ago. I finally saved up enough to get it, but the damn crook raised the price on me, and now he's threatenin' to sell it if I don't come back with more!' His voice begins to tremble. 'I... i was gonna propose to her with that ring... but now...' He trails off again, desperately attempting to not cry.",
			"TalkerType": "Event",
			"Optioncount": 2,
			"Option1": "Offer to have a talk with the crooked clerk.",
			"Option2": "Convince him that he doesn't need a ring to show his love to his wife.",
			"Option3": "text",
			"Option4": "text",
			"Option1outcome": "You discreetly show off your weapon and offer to make the clerk reconsider. Ten minutes later, you and the man are standing outside the store, the man beaming with the ring in his hands. The nice clerk even deigned to give the man a discount, which he graciously gave back to you!",
			"Option2outcome": "If she truly loves him, she doesn't need any stinking ring! But if he's deadset on one, he could try a jeweler in Little Italy that could cut him a deal- a jeweler who may or may not be your cousin...",
			"Option3outcome": "text",
			"Option4outcome": "text"
		},
		{
			"TalkerId": 6,
			"TalkerName": "Event6",
			"TalkerText": "An elderly woman waits on the street corner, attempting to cross the fairly busy intersection.",
			"TalkerType": "Event",
			"Optioncount": 2,
			"Option1": "Stop to help her across.",
			"Option2": "Continue on.",
			"Option3": "text",
			"Option4": "text",
			"Option1outcome": "The woman sees you approach.",
			"Option2outcome": "You have something more important to worry about. You continue on your way, the woman disappearing in your rearview mirror.",
			"Option3outcome": "text",
			"Option4outcome": "text"
		},
		{
			"TalkerId": 1,
			"TalkerName": "mystery1",
			"TalkerText": "ghostbusters",
			"TalkerType": "Mystery",
			"Optioncount": 4,
			"Option1": "text",
			"Option2": "text",
			"Option3": "text",
			"Option4": "text",
			"Option1outcome": "text",
			"Option2outcome": "text",
			"Option3outcome": "text",
			"Option4outcome": "text"
		},
		{
			"TalkerId": 2,
			"TalkerName": "mystery2",
			"TalkerText": "scooby-doo",
			"TalkerType": "Mystery",
			"Optioncount": 4,
			"Option1": "text",
			"Option2": "text",
			"Option3": "text",
			"Option4": "text",
			"Option1outcome": "text",
			"Option2outcome": "text",
			"Option3outcome": "text",
			"Option4outcome": "text"
		}
	]
}